src/main/resources/ReadSecurityHeaderViaXsltSource.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope"
          xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
          xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
          xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
          xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<!-- https://www.oasis-open.org/committees/download.php/16782/wss-v1.1-spec-os-UsernameTokenProfile.pdf -->
<!-- https://docs.oracle.com/cd/E21455_01/common/tutorials/authn_ws_user.html -->
<Header>
    <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                        wsu:Id="SecurityToken-6138db82-5a4c-4bf7-915f-af7a10d9ae96">
        <wsse:Username>Someuser</wsse:Username>
        <wsse:Password
                Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
            CBb7a2itQDgxVkqYnFtggUxtuqk=
        </wsse:Password>
        <wsse:Nonce>5ABcqPZWb6ImI2E6tob8MQ==</wsse:Nonce>
        <wsu:Created>2010-06-08T07:26:50Z</wsu:Created>
    </wsse:UsernameToken>
</Header>
<Body>
    <SomeRequest xmlns="http://example.ns.com/foo/bar" />
</Body>
</Envelope>